{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "de397937-bdd0-4b8c-9f24-7a0fc9cd40e6",
   "metadata": {},
   "source": [
    "Тема 2. Управляющие конструкции и коллекции, часть 2"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6898630e-bf77-4d99-ba4f-d779bc7645e0",
   "metadata": {},
   "source": [
    "Задание 1. Написать код на Python в среде Jupyter Notebook для решения следующей задачи.\n",
    "Дана переменная, в которой хранится словарь, содержащий гео-метки для каждого\n",
    "пользователя (пример структуры данных приведен ниже). Вам необходимо написать\n",
    "программу, которая выведет на экран множество уникальных гео-меток всех пользователей.\n",
    "Пример работы программы:\n",
    "ids = {'user1': [213, 213, 213, 15, 213],\n",
    "'user2': [54, 54, 119, 119, 119],\n",
    "'user3': [213, 98, 98, 35]}\n",
    "Результат: {98, 35, 15, 213, 54, 119}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "db8b2463-7fb8-4084-9376-ed5cc6b97474",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{98, 35, 15, 213, 54, 119}\n"
     ]
    }
   ],
   "source": [
    "ids = {\n",
    "    'user1': [213, 213, 213, 15, 213],\n",
    "    'user2': [54, 54, 119, 119, 119],\n",
    "    'user3': [213, 98, 98, 35]\n",
    "} #исходный словарь гео-меток\n",
    "\n",
    "unique_geo_mark = set() #список для уникальных гео-меток (т.о. избежим добавление повторяющихся элементов методом set)\n",
    "#пробегаемся по всем значениям и методом update добавляем в список кникальных гео-меток \n",
    "for geo in ids.values():\n",
    "    unique_geo_mark.update(geo)\n",
    "print(unique_geo) #выводим результат"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1d88f87d-f778-4a49-9a2f-c4e4c240731c",
   "metadata": {},
   "source": [
    "Задание 2. Написать код на Python в среде Jupyter Notebook для решения следующей задачи.\n",
    "Дана переменная, в которой хранится список поисковых запросов пользователя (пример\n",
    "структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на\n",
    "экран распределение количества слов в запросах в требуемом виде.\n",
    "Пример работы программы:\n",
    "queries = [\n",
    "'смотреть сериалы онлайн',\n",
    "'новости спорта',\n",
    "'афиша кино',\n",
    "'курс доллара',\n",
    "'сериалы этим летом',\n",
    "'курс по питону',\n",
    "'сериалы про спорт',\n",
    "]\n",
    "Результат:\n",
    "Поисковых запросов, содержащих 2 слов(а): 42.86%\n",
    "Поисковых запросов, содержащих 3 слов(а): 57.14%"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "eeff821e-261a-4726-8896-71ee92e8d754",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Поисковых запросов, содержащих 3 слов(а): 57.14%\n",
      "Поисковых запросов, содержащих 2 слов(а): 42.86%\n"
     ]
    }
   ],
   "source": [
    "queries = [\n",
    "'смотреть сериалы онлайн',\n",
    "'новости спорта',\n",
    "'афиша кино',\n",
    "'курс доллара',\n",
    "'сериалы этим летом',\n",
    "'курс по питону',\n",
    "'сериалы про спорт',\n",
    "] #исходный словарь с запросами\n",
    "\n",
    "word_count_distribution = {} # cловарь для хранения количества запросов по количеству слов\n",
    "\n",
    "# подсчет количества слов в каждом запросе\n",
    "for query in queries:\n",
    "    word_count = len(query.split())\n",
    "    \n",
    "    # увеличиваем счетчик по кол-ву слов\n",
    "    if word_count in word_count_distribution:\n",
    "        word_count_distribution[word_count] += 1\n",
    "    else:\n",
    "        word_count_distribution[word_count] = 1\n",
    "\n",
    "total_queries = len(queries) # общее количество запросов\n",
    "\n",
    "# вывод распределения через ключ-значение\n",
    "for count, freq in word_count_distribution.items():\n",
    "    percentage = (freq / total_queries) * 100 # вычисляем процентное соотношение для каждой итерации\n",
    "    print(f'Поисковых запросов, содержащих {count} слов(а): {percentage:.2f}%')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1ed5a3dc-4646-4801-ad68-762a18767ee2",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
